# Pandas 기초

- Pandas는 파이썬에서 사용하는 데이터 분석 라이브러리로, 행과 열로 이루어진 데이터 객체를 다룰 수 있게 되며 보다 안정적으로 대용량의 데이터들을 처리하는 데 매우 편리한 도구

### 1. Pandas 불러오기

In [2]:
import pandas as pd
import numpy as np

### 2. Pandas 자료구조
- Pandas에서는 기본적으로 정의되는 자료구조인 Series와 DataFrame을 사용합니다.
- 이 자료구조들은 빅데이터 분석에 있어서 높은 수준의 성능을 보여줍니다.

#### 2-1. Series 자료구조

In [3]:
# Series 정의하기
Series_type = pd.Series([4, 7, -5, 3])

# Series의 값만 확인하기
Series_type.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
# Series의 인덱스만 확인하기
Series_type.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# Series의 자료형 확인하기
Series_type.dtypes

dtype('int64')

In [6]:
# Series 인덱스 지정
Series_type_new_index = pd.Series([4, 7, -5, 3],
                                  index = ['d', 'b', 'a', 'c'])

In [7]:
# dictionary를 Series로 만들기
# dictionary의 key가 인덱스로 지정
dict_data = {'kim':100, 'lee':90, 'jung':80, 'hong':95}
dict_to_series = pd.Series(dict_data)
dict_to_series

kim     100
lee      90
jung     80
hong     95
dtype: int64

In [8]:
# Series의 명칭과 인덱스명 설정
dict_to_series.name = 'Salary'
dict_to_series.index.name = 'Names'
dict_to_series

Names
kim     100
lee      90
jung     80
hong     95
Name: Salary, dtype: int64

In [9]:
# Series 인덱스 변경
dict_to_series.index = ['A', 'B', 'C', 'D']
dict_to_series

A    100
B     90
C     80
D     95
Name: Salary, dtype: int64

#### 2-2. DataFrame 자료구조

In [10]:
# Dataframe 정의
data = {'name':['kim', 'kim', 'kim', 'lee', 'hong'],
       'year':[2013, 2014, 2015, 2016, 2017],
       'points':[2, 3, 4, 5, 3]}

df = pd.DataFrame(data)
df

   name  year  points
0   kim  2013       2
1   kim  2014       3
2   kim  2015       4
3   lee  2016       5
4  hong  2017       3

In [11]:
# index와 column 확인
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=5, step=1)
Index(['name', 'year', 'points'], dtype='object')

In [12]:
# 값 확인
df.values

array([['kim', 2013, 2],
       ['kim', 2014, 3],
       ['kim', 2015, 4],
       ['lee', 2016, 5],
       ['hong', 2017, 3]], dtype=object)

In [13]:
# 인덱스와 열에 대한 이름 설정
df.index.name = 'NUM'
df.columns.name = "Info"
df

Info  name  year  points
NUM
0      kim  2013       2
1      kim  2014       3
2      kim  2015       4
3      lee  2016       5
4     hong  2017       3

In [14]:
# DataFrame을 만드는 과정에서 column과 index 설정
# dictionary와 columns의 순서가 맞지 않아도 알아서 정의되지만,
# Null Value로 나타난다.

df2 = pd.DataFrame(data,
               columns = ['year', 'name', 'points', 'penalty'],
               index = ['one', 'two', 'three', 'four', 'five'])
df2

       year  name  points penalty
one    2013   kim       2     NaN
two    2014   kim       3     NaN
three  2015   kim       4     NaN
four   2016   lee       5     NaN
five   2017  hong       3     NaN

In [15]:
# 새로운 열 추가
df2['zeros'] = np.arange(5)
df2

       year  name  points penalty  zeros
one    2013   kim       2     NaN      0
two    2014   kim       3     NaN      1
three  2015   kim       4     NaN      2
four   2016   lee       5     NaN      3
five   2017  hong       3     NaN      4

In [16]:
# Series를 새로운 열로 추가
# index에 맞춰서 들어간다.
value = pd.Series([-12, -15, -17],
                  index = ['two', 'four', 'five'])
df2['debt'] = value
df2

       year  name  points penalty  zeros  debt
one    2013   kim       2     NaN      0   NaN
two    2014   kim       3     NaN      1 -12.0
three  2015   kim       4     NaN      2   NaN
four   2016   lee       5     NaN      3 -15.0
five   2017  hong       3     NaN      4 -17.0

In [17]:
# 열 삭제
del df2['zeros']
df2

       year  name  points penalty  debt
one    2013   kim       2     NaN   NaN
two    2014   kim       3     NaN -12.0
three  2015   kim       4     NaN   NaN
four   2016   lee       5     NaN -15.0
five   2017  hong       3     NaN -17.0

#### 2-3.DataFrame에서 행을 선택하고 조작하기 (인덱싱)

In [18]:
df = df2

In [19]:
# 0번째 부터 2번째 까지 행을 가져옴
df[0:3]

       year name  points penalty  debt
one    2013  kim       2     NaN   NaN
two    2014  kim       3     NaN -12.0
three  2015  kim       4     NaN   NaN

In [20]:
# 1번째 부터 3번째까지 행을 가져옴 (loc)
df.loc['two':'four']

       year name  points penalty  debt
two    2014  kim       3     NaN -12.0
three  2015  kim       4     NaN   NaN
four   2016  lee       5     NaN -15.0

In [21]:
# points 열의 1번째 부터 3번째까지 행을 가져옴 (loc)
df.loc['two':'four', 'points']

two      3
three    4
four     5
Name: points, dtype: int64

In [22]:
# 새로운 행 삽입하기
df.loc['six',:] = [2014, 'jun', 4.0, 0.1, -20] 
df

         year  name  points penalty  debt
one    2013.0   kim     2.0     NaN   NaN
two    2014.0   kim     3.0     NaN -12.0
three  2015.0   kim     4.0     NaN   NaN
four   2016.0   lee     5.0     NaN -15.0
five   2017.0  hong     3.0     NaN -17.0
six    2014.0   jun     4.0     0.1 -20.0

In [23]:
# iloc인덱싱
df.iloc[[0, 1, 3], [1, 2]]

     name  points
one   kim     2.0
two   kim     3.0
four  lee     5.0

### 3. Data

In [24]:
# dataframe 정의
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0  0.268639  0.025462  0.180030  1.523984
1  0.729016  0.444074  0.311564 -3.117667
2  0.195033 -0.205909  1.464761 -0.521393
3  0.557003 -1.419804  0.895612 -0.008003
4 -0.526268 -0.548310 -1.588735  0.461697
5 -0.215721  0.292088  0.950425 -0.074577

In [26]:
# pandas에서 제공하는 date range함수는 datetime 자료형으로 구성된,
# 날짜 시각 등을 알 수 있는 자료형을 만드는 함수
df.columns = ['A', 'B', 'C', 'D']
# 6일간의 datetime으로 인덱스 설정
df.index = pd.date_range('20160701', periods = 6)
df.index

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df

                   A         B         C         D
2016-07-01  0.268639  0.025462  0.180030  1.523984
2016-07-02  0.729016  0.444074  0.311564 -3.117667
2016-07-03  0.195033 -0.205909  1.464761 -0.521393
2016-07-04  0.557003 -1.419804  0.895612 -0.008003
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697
2016-07-06 -0.215721  0.292088  0.950425 -0.074577

In [28]:
df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

                   A         B         C         D    F
2016-07-01  0.268639  0.025462  0.180030  1.523984  1.0
2016-07-02  0.729016  0.444074  0.311564 -3.117667  NaN
2016-07-03  0.195033 -0.205909  1.464761 -0.521393  3.5
2016-07-04  0.557003 -1.419804  0.895612 -0.008003  6.1
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697  NaN
2016-07-06 -0.215721  0.292088  0.950425 -0.074577  7.0

#### 3-1. Null값 처리

In [29]:
# 행의 값 중 하나라도 null인 경우 그 행 제거
df.dropna(how = 'any')

                   A         B         C         D    F
2016-07-01  0.268639  0.025462  0.180030  1.523984  1.0
2016-07-03  0.195033 -0.205909  1.464761 -0.521393  3.5
2016-07-04  0.557003 -1.419804  0.895612 -0.008003  6.1
2016-07-06 -0.215721  0.292088  0.950425 -0.074577  7.0

In [30]:
# 행의 모든 값이 null인 경우 그 행 제거
df.dropna(how = 'all')

                   A         B         C         D    F
2016-07-01  0.268639  0.025462  0.180030  1.523984  1.0
2016-07-02  0.729016  0.444074  0.311564 -3.117667  NaN
2016-07-03  0.195033 -0.205909  1.464761 -0.521393  3.5
2016-07-04  0.557003 -1.419804  0.895612 -0.008003  6.1
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697  NaN
2016-07-06 -0.215721  0.292088  0.950425 -0.074577  7.0

In [31]:
# null값 대체
df.fillna(0.5)

                   A         B         C         D    F
2016-07-01  0.268639  0.025462  0.180030  1.523984  1.0
2016-07-02  0.729016  0.444074  0.311564 -3.117667  0.5
2016-07-03  0.195033 -0.205909  1.464761 -0.521393  3.5
2016-07-04  0.557003 -1.419804  0.895612 -0.008003  6.1
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697  0.5
2016-07-06 -0.215721  0.292088  0.950425 -0.074577  7.0

In [32]:
# 특정 열에서 null값을 포함하는 행만 추출하기
df.loc[df.isnull()['F'], :]

                   A         B         C         D   F
2016-07-02  0.729016  0.444074  0.311564 -3.117667 NaN
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697 NaN

In [36]:
# 특정 행 제거
df.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  0.729016  0.444074  0.311564 -3.117667  NaN
2016-07-03  0.195033 -0.205909  1.464761 -0.521393  3.5
2016-07-04  0.557003 -1.419804  0.895612 -0.008003  6.1
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697  NaN
2016-07-06 -0.215721  0.292088  0.950425 -0.074577  7.0

In [37]:
# 특정 열 제거
df.drop('F', axis = 1)

                   A         B         C         D
2016-07-01  0.268639  0.025462  0.180030  1.523984
2016-07-02  0.729016  0.444074  0.311564 -3.117667
2016-07-03  0.195033 -0.205909  1.464761 -0.521393
2016-07-04  0.557003 -1.419804  0.895612 -0.008003
2016-07-05 -0.526268 -0.548310 -1.588735  0.461697
2016-07-06 -0.215721  0.292088  0.950425 -0.074577

### 4. 계산식 함수

In [39]:
# dataframe 정의
data = [[1.4, np.nan],
        [7.1, -4.5],
       [np.nan, np.nan],
       [0.75, -1.3]]

df = pd.DataFrame(data, columns = ['one', 'two'],
                 index = ['a', 'b', 'c', 'd'])

In [40]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [41]:
# 열의 합 (행 방향이므로 axis = 0)
# null값은 0으로 생각
df.sum(axis = 0)

one    9.25
two   -5.80
dtype: float64

In [42]:
# 행의 합 (열 방향이므로 axis = 1)
# null값은 0으로 생각
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [43]:
# null값을 0으로 생각하지 않고 그대로 받는 경우
df.sum(axis = 1, skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [44]:
# 특정 행 혹은 열에서만 계산하기
print(df['one'].sum())
print(df.loc['b'].sum())

9.25
2.5999999999999996

#### pandas dataframe 적용 계산 함수 정리
<br>
- count: 전체 개수 계산<br>
- min, max: 최소, 최대값 계산<br>
- argmin, argmax: 전체 값 중 최소, 최대값의 인덱스 반환<br>
- idxmin, idxmax: 전체 인덱스 중 최소, 최대값 반환<br>
- quantile: 전체 값의 특정 사분위수에 해당하는 값 반환<br>
- sum: 전체 값의 합 계산<br>
- mean: 전체 값의 평균 계산<br>
- median: 전체 값의 중앙값 계산<br>
- mad: 전체 값의 평균으로부터의 절대 편차의 평균 계산<br>
- std, var: 전체 값의 표준편차, 분산 계산<br>
- cumsum: 맨 첫 값부터 각 값까지의 누적합 계산 (0에서부터 시작)<br>
- cumprod: 맨 첫 값부터 각 값까지의 누적곱 계산 (1에서부터 시작)

In [45]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                  columns = ['A', 'B', 'C', 'D'],
                  index = pd.date_range('20160701', periods = 6))
df2

                   A         B         C         D
2016-07-01 -1.044331  0.721832 -1.202629  0.381702
2016-07-02 -0.500464 -0.442126  0.076523 -0.645767
2016-07-03 -0.864846  0.344902 -0.493828  0.889224
2016-07-04  1.702334 -1.751240 -1.480350 -1.129717
2016-07-05  0.574104  0.517336  0.128226  1.339358
2016-07-06  2.034332 -1.063475  0.739533 -1.479462

In [46]:
# A열과 B열의 상관계수 계산
df2['A'].corr(df2['B'])

-0.7869762282448338

In [47]:
# B열과 C열의 공분산 계산
df2['B'].cov(df2['C'])

0.03552797247218289

#### 4-1. 정렬 및 기타 함수

In [48]:
dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index = random_dates,
                  columns = ['D', 'B', 'C', 'A'])
df2

                   D         B         C         A
2016-07-03  0.889224  0.344902 -0.493828 -0.864846
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464
2016-07-06 -1.479462 -1.063475  0.739533  2.034332
2016-07-01  0.381702  0.721832 -1.202629 -1.044331
2016-07-05  1.339358  0.517336  0.128226  0.574104

In [49]:
# index와 column의 순서 오름차순으로 정렬
df2.sort_index(axis = 0)

                   D         B         C         A
2016-07-01  0.381702  0.721832 -1.202629 -1.044331
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464
2016-07-03  0.889224  0.344902 -0.493828 -0.864846
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334
2016-07-05  1.339358  0.517336  0.128226  0.574104
2016-07-06 -1.479462 -1.063475  0.739533  2.034332

In [50]:
df2.sort_index(axis = 1)

                   A         B         C         D
2016-07-03 -0.864846  0.344902 -0.493828  0.889224
2016-07-04  1.702334 -1.751240 -1.480350 -1.129717
2016-07-02 -0.500464 -0.442126  0.076523 -0.645767
2016-07-06  2.034332 -1.063475  0.739533 -1.479462
2016-07-01 -1.044331  0.721832 -1.202629  0.381702
2016-07-05  0.574104  0.517336  0.128226  1.339358

In [52]:
# 내림차순 정렬은 ascending 파라미터
df2.sort_index(axis = 0, ascending = False)

                   D         B         C         A
2016-07-06 -1.479462 -1.063475  0.739533  2.034332
2016-07-05  1.339358  0.517336  0.128226  0.574104
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334
2016-07-03  0.889224  0.344902 -0.493828 -0.864846
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464
2016-07-01  0.381702  0.721832 -1.202629 -1.044331

In [53]:
# 값 기준 정렬하기
# D열의 값이 오름차순이 되도록 정렬
df2.sort_values(by = 'D')

                   D         B         C         A
2016-07-06 -1.479462 -1.063475  0.739533  2.034332
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464
2016-07-01  0.381702  0.721832 -1.202629 -1.044331
2016-07-03  0.889224  0.344902 -0.493828 -0.864846
2016-07-05  1.339358  0.517336  0.128226  0.574104

In [54]:
# B열의 값이 내림차순이 되도록 정렬
df2.sort_values(by = 'B', ascending = False)

                   D         B         C         A
2016-07-01  0.381702  0.721832 -1.202629 -1.044331
2016-07-05  1.339358  0.517336  0.128226  0.574104
2016-07-03  0.889224  0.344902 -0.493828 -0.864846
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464
2016-07-06 -1.479462 -1.063475  0.739533  2.034332
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334

In [55]:
df2["E"] = np.random.randint(0, 6, size=6)
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df2

                   D         B         C         A  E      F
2016-07-03  0.889224  0.344902 -0.493828 -0.864846  1  alpha
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334  5   beta
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464  1  gamma
2016-07-06 -1.479462 -1.063475  0.739533  2.034332  1  gamma
2016-07-01  0.381702  0.721832 -1.202629 -1.044331  1  alpha
2016-07-05  1.339358  0.517336  0.128226  0.574104  2  gamma

In [56]:
# E열과 F열을 동시에 고려하여 오름차순
df2.sort_values(by = ['E', 'F'])

                   D         B         C         A  E      F
2016-07-03  0.889224  0.344902 -0.493828 -0.864846  1  alpha
2016-07-01  0.381702  0.721832 -1.202629 -1.044331  1  alpha
2016-07-02 -0.645767 -0.442126  0.076523 -0.500464  1  gamma
2016-07-06 -1.479462 -1.063475  0.739533  2.034332  1  gamma
2016-07-05  1.339358  0.517336  0.128226  0.574104  2  gamma
2016-07-04 -1.129717 -1.751240 -1.480350  1.702334  5   beta

In [57]:
# 지정한 행 또는 열에 특정 값이 있는지 확인
df2['F'].isin(['alpha', 'beta'])

2016-07-03     True
2016-07-04     True
2016-07-02    False
2016-07-06    False
2016-07-01     True
2016-07-05    False
Name: F, dtype: bool